import 'package:places/domain/sight.dart';

final List<Sight> mocks = <Sight>[
  const Sight(
    details:
        'Древний город, расположенный на восточном берегу озера Бахира на территории современного государства Тунис, близ города Тунис.',
    lat: 36.86,
    lon: 10.33,
    name: 'Карфаген',
    url: 'shorturl.at/vGHN1',
  ),
  const Sight(
    details:
        'Цзыцзиньчэн, буквально: «Пурпурный запретный город». Самый обширный дворцовый комплекс в мире.',
    lat: 39.92,
    lon: 116.39,
    name: 'Запретный город',
    url: 'shorturl.at/mDX16',
  ),
  const Sight(
    details:
        'Рынок, расположенный в старой части Стамбула, в районе Эминёню; второй по величине рынок города после Гранд-базара',
    lat: 41.02,
    lon: 28.97,
    name: 'Египетский базар',
    url: 'shorturl.at/efMN0',
  ),
];
