import 'package:places/domain/sight.dart';

final List<Sight> mocks = <Sight>[
  const Sight(
    details:
        'Surf Coffee — это сеть кофеен по всей России, которая объединила людей, близких к философии сёрфинга. Их всех связывает одно — безумная любовь к свободе.',
    lat: 45.04624,
    lon: 38.97879,
    name: 'Surf Coffee',
    type: 'кофейня',
    url:
        'https://avatars.mds.yandex.net/get-altay/4916794/2a000001818ca3d9314604509372f4277feb/XXL',
  ),
  const Sight(
    details:
        'Мясной ресторан «Скотина» специализируется на приготовлении мясных блюд, в первую очередь – из местного кубанского мяса.',
    lat: 45.02266,
    lon: 38.98744,
    name: 'Скотина',
    type: 'ресторан',
    url: 'https://scotina.ru/wp-content/themes/scotina/img/interior/09.jpg',
  ),
  const Sight(
    details:
        'Городской парк, расположенный на северо-востоке от центра Краснодара в Школьном микрорайоне, между улицами Восточно-Кругликовская и Героя Владислава Посадского, рядом со стадионом ФК «Краснодар».',
    lat: 45.04447,
    lon: 39.02924,
    name: 'Парк Галицкого',
    type: 'парк',
    url: 'https://img.geliophoto.com/parkkrasnodar/02_parkkrasnodar.jpg',
  ),
  const Sight(
    details:
        'На трёх этажах комплекса разместились торговые галереи, мультиплекс на 8 залов, зона развлечений, фуд-корт, а также парковка на 850 машиномест на крыше здания.',
    lat: 45.039464,
    lon: 38.974307,
    name: 'Галерея Краснодар',
    type: 'торгово-развлекательный комплекс',
    url: 'https://www.galleryk.ru/upload/iblock/0b1/lc4xx3uearu.jpg',
  ),
  const Sight(
    details:
        'Уникальная коллекция раритетных олдтаймеров, которая интересна тем, что постоянно обновляется и все экспонаты находятся в отличном действующем состоянии, участвуют в выставках и ретроралли.',
    lat: 45.000173,
    lon: 39.024406,
    name: 'Музей Ретро-автомобилей',
    type: 'частный музей',
    url:
        'https://www.i-npz.ru/wp-content/uploads/2021/05/08.05.2021.-%D0%9C%D1%83%D0%B7%D0%B5%D0%B9-%D0%90%D0%B2%D1%82%D0%BE-119-1024x683.jpg',
  ),
  const Sight(
    details:
        'Место, где можно приятно провести время за кружкой пенного пива, отдохнуть в компании друзей, сытно подкрепиться, посмотреть трансляции важных матчей и послушать хорошую музыку в живом исполнении; в заведении регулярно проводятся концерты.',
    lat: 45.031005,
    lon: 38.974154,
    name: 'Willson Pub',
    type: 'бар',
    url:
        'https://www.i-npz.ru/wp-content/uploads/2021/05/08.05.2021.-%D0%9C%D1%83%D0%B7%D0%B5%D0%B9-%D0%90%D0%B2%D1%82%D0%BE-119-1024x683.jpg',
  ),
];
